Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Check if the contents of two settings are equal.
other:
The settings to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Assign(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Assigns values of the source settings to this object.
other:
The source settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.Color,Autodesk.Revit.DB.Color)
Constructs color settings object from given colors.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014